### 大数据方向自我介绍

我的名字叫易斌鑫,容易的易,~~朋友都叫我小易~~.
93年生,今年24.来自依山傍水的江西萍乡.
2014年年毕业于现电子科技大学,数学系,学历本科.

在西安一家互联网教育企业工作了三年.~~公司叫"博创软件"~~
工作的职责是JAVA后端开发.
具体的工作项目包括:
1.搜索系统开发维护
2.日志收集系统开发
3.日志监控系统搭建
4.分布式架构研究
5.自动化部署实践
6.在线视频资源服务开发等.

拥有三年JAVA后台服务开发经验,熟悉Spring,Hibernate开发框架及Mysql,Redis,MongoDB数据库.
一直使用Linux系统办公和学习,熟悉Linux环境及Shell脚本.
对长文本搜索有长时间的研究,在网上参与翻译了Solr的使用指南.使用ELK组合框架搭建了服务日志监控平台.
此外,从零开始给公司搭建大数据服务平台,在Zookeeper,Hadoop,Hive,Flume等有一定实践.
之前也了解过相关大数据及分布式计算原理.

我对自己的定位是一名热爱学习并喜欢实践的程序员.
靠现有的技术经验,在赞同科技工作并有所成就.
